src/cf/Documents/НачислениеСписаниеБонусныхБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеСписаниеБонусныхБаллов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеБаллы</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияБонусныхБаллов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленияБонусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонуснаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаНачисленияБонусов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АналитикаНачисленияБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСгорания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписанияБонусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонуснаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаКСписанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/НачислениеСписаниеБонусныхБаллов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросОПерезаполнении()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОПерезаполненииЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОПерезаполненииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоПрограммеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте 
Процедура ОбновитьОтсрочкуСписания()
	ПараметрыОтсрочки = ПараметрыОтсрочкиСписания(Объект.БонуснаяПрограмма);
	СписаниеНеиспользованных = ПараметрыОтсрочки.СписаниеНеиспользованных;
	ОтсрочкаСписания = ПараметрыОтсрочки.КоличествоПериодовСписания;
	ПериодичностьОтсрочкиСписания = ПараметрыОтсрочки.ПериодичностьСписания;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОтсрочкиСписания(БонуснаяПрограмма)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БонуснаяПрограмма,"СписаниеНеиспользованных, КоличествоПериодовСписания, ПериодичностьСписания");
КонецФункции
#КонецОбласти



#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьПоПрограммеНаСервере()
	
	Объект.НачисленияБонусов.Очистить();
	
	Карты = РаботаСБонусами.ПолучитьКартыБонуснойПрограммы(Объект.БонуснаяПрограмма);
	
	Для Каждого Карта Из Карты Цикл
		
		НоваяСтрока = Объект.НачисленияБонусов.Добавить();
		НоваяСтрока.БонуснаяКарта = Карта;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПрограмме(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.БонуснаяПрограмма) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите бонусную программу'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "БонуснаяПрограмма", "Объект.БонуснаяПрограмма");
		Возврат;
	КонецЕсли;
	
	Если Объект.НачисленияБонусов.Количество() = 0 Тогда
		ЗаполнитьПоПрограммеНаСервере();
	Иначе
		ВопросОПерезаполнении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачисленияСгорания(Команда)
	
	ДатаСгорания = ОбщегоНазначенияКлиент.ДатаСеанса();
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуНачисленияСгоранияЗавершение", ЭтотОбъект, Команда.Имя);
	
	ПоказатьВводДаты(ОписаниеОповещения, ДатаСгорания, НСтр("ru = 'Укажите дату'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачисленияСгоранияЗавершение(Результат, ИмяКоманды) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаБонусов Из Объект.НачисленияБонусов Цикл
		
		Если ИмяКоманды = "УстановитьДатуНачисления" Тогда
			СтрокаБонусов.ДатаНачисления = Результат;
			СтрокаБонусов.ДатаСгорания = ПрибавитьКДатеПериод(СтрокаБонусов.ДатаНачисления, ОтсрочкаСписания, ПериодичностьОтсрочкиСписания)
		ИначеЕсли ИмяКоманды = "УстановитьДатуСгорания" Тогда
			СтрокаБонусов.ДатаСгорания = Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоБаллов(Команда)
	
	КоличествоБаллов = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьКоличествоБалловЗавершение", ЭтотОбъект);
	
	ПоказатьВводЧисла(ОписаниеОповещения, КоличествоБаллов, НСтр("ru = 'Введите количество баллов для начисления'"), 15, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоБалловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаБонусов Из Объект.НачисленияБонусов Цикл
		
		СтрокаБонусов.Количество = Результат;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.СлужебныйДокумент Тогда
		ТолькоПросмотр = Истина;
		Элементы.БонусыЗаполнитьПоПрограмме.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьОтсрочкуСписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапкиФормы

&НаКлиенте
Процедура БонуснаяПрограммаПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОЗаполненииПоБонуснойПрограммеЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Заполнить табличную часть картами бонусной программы?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	ОбновитьОтсрочкуСписания();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВопросОЗаполненииПоБонуснойПрограммеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Объект.НачисленияБонусов.Количество() = 0 Тогда
			ЗаполнитьПоПрограммеНаСервере();
		Иначе
			ВопросОПерезаполнении();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовТабличныхЧастейФормы

&НаКлиенте
Процедура БонусыДатаНачисленияПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.Бонусы.ТекущаяСтрока;
	ТекущаяСтрока = Объект.НачисленияБонусов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ ТекущаяСтрока = Неопределено Тогда	
		ТекущаяСтрока.ДатаСгорания = ПрибавитьКДатеПериод(ТекущаяСтрока.ДатаНачисления, ОтсрочкаСписания, ПериодичностьОтсрочкиСписания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПрибавитьКДатеПериод(ИсходнаяДата, КоличествоПериодов, Периодичность)
	Результат = Неопределено;
	Если НЕ СписаниеНеиспользованных Тогда
		Результат = Дата(1,1,1);			
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда 
		Результат = ИсходнаяДата + (3600 * 24) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда 
		Результат = ИсходнаяДата + (3600 * 24 * 7) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда 
		Результат = ИсходнаяДата + (3600 * 24 * 10) * КоличествоПериодов;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 1 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 3 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 6 * КоличествоПериодов);
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда 
		Результат = ДобавитьМесяц(ИсходнаяДата, 12 * КоличествоПериодов);
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура БонусыБонуснаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораБонуснойКарты(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписанияБонусовБонуснаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораБонуснойКарты(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораБонуснойКарты(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(Элемент.Родитель.Имя + "БонуснаяКартаЗавершениеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("БонуснаяПрограмма", Объект.БонуснаяПрограмма);
	ОткрытьФорму("Справочник.ДисконтныеКарты.ФормаВыбора",
		ПараметрыФормы,
		Элемент.Родитель.ТекущиеДанные.БонуснаяКарта,
		УникальныйИдентификатор,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура БонусыБонуснаяКартаЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элементы.Бонусы.ТекущиеДанные.БонуснаяКарта = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписанияБонусовБонуснаяКартаЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элементы.СписанияБонусов.ТекущиеДанные.БонуснаяКарта = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОБласти
